Revit 2027 API
RebarShapeDrivenAccessor.SetLayoutAsCustomSpacing Method
 Sets the Layout Rule property of rebar set to Custom Spacing.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetLayoutAsCustomSpacing(
	string customSpacingFormula,
	double arrayLength,
	bool barsOnNormalSide,
	bool includeFirstBar,
	bool includeLastBar
)
Public Sub SetLayoutAsCustomSpacing (
	customSpacingFormula As String,
	arrayLength As Double,
	barsOnNormalSide As Boolean,
	includeFirstBar As Boolean,
	includeLastBar As Boolean
)
public:
void SetLayoutAsCustomSpacing(
	String^ customSpacingFormula,
	double arrayLength,
	bool barsOnNormalSide,
	bool includeFirstBar,
	bool includeLastBar
)
member SetLayoutAsCustomSpacing :
        customSpacingFormula : string *
        arrayLength : float *
        barsOnNormalSide : bool *
        includeFirstBar : bool *
        includeLastBar : bool -> unit
Parameters
customSpacingFormula String
 The layout formula.
arrayLength Double
 The distribution length of rebar set. This will be used only if the formula contains percentage or it contains "?", otherwise the array length will be calculated from the formula and will be stored in the rebar.
barsOnNormalSide Boolean
 Identifies if the bars of the rebar set are on the same side of the rebar plane indicated by the normal.
includeFirstBar Boolean
 Identifies if the first bar in rebar set is shown.
includeLastBar Boolean
 Identifies if the last bar in rebar set is shown.
Exceptions
Exception | Condition
ArgumentException |  The specified formula is not valid (doesn't have a valid syntax).
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  the set length arrayLength isn't acceptable.
InapplicableDataException |  This RebarShapeDrivenAccessor is an instance of a spiral or multiplanar shape.
InvalidOperationException |  This RebarShapeDrivenAccessor doesn't contain a valid rebar reference.
See Also
Reference
RebarShapeDrivenAccessor Class
Autodesk.Revit.DB.Structure Namespace